app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(title: params[:title], room_number: params[:room_number])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Class A"], ["room_number", 101], ["created_at", "2019-09-24 09:22:36.290500"], ["updated_at", "2019-09-24 09:22:36.290500"]]