app/controllers/students_controller.rb

  def update
    @student = set_student
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jonas"], ["last_name", "Cannabino"], ["updated_at", "2019-09-24 08:26:29.744423"], ["id", 5]]